#include <stdio.h>

int main(){
    int i;
    printf("과세 표준을 입력하시오(만원):");
    scanf("%d", &i);

    if(i <= 1000){
        printf("소득세는 %d만원입니다\n" , i*8 / 100);
    }
    else if(i <= 4000)
    {
        printf("소득세는 %d만원입니다\n", 1000*8/100 + (i-1000) * 17 / 100);
    }
    else if(i <= 8000)
    {
        printf("소득세는 %d만원입니다\n", 1000*8/100 + 3000 * 17 / 100 + (i-4000) * 26 / 100);
    }
    else{
        printf("소득세는 %d만원입니다\n", 1000*8/100 + 3000 * 17 / 100 + 4000 * 26 / 100 + (i-8000 * 35 / 100));
    }
    return 0;
}